baseline/perf/dictionary.yaml
config:
  payload:
    path: "./words.csv"
    fields:
      - "word"
  environments:
    api:
      target: 'http://localhost:5555/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
  

  pool: 5 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: "Initialization phase"
      duration: 30 
      arrivalRate: 2 
    - name: "Moderate Load"
      duration: 60
      arrivalRate: 5
      rampTo: 10
    - name: "Load Increase"
      duration: 60
      arrivalRate: 10
      rampTo: 20
    - name: "Constant load"
      duration: 60
      arrivalRate: 20
    - name: "Abrupt jump"
      duration: 60
      arrivalRate: 60
    - name: "Load Increase"
      duration: 60
      arrivalRate: 60
      rampTo: 90
    - name: "Hold load"
      duration: 30
      arrivalRate: 90  
    - name: "Abrupt jump"
      duration: 30
      arrivalRate: 200
    - name: "Abrupt jump"
      duration: 30
      arrivalRate: 220
    - name: "Abrupt jump"
      duration: 30
      arrivalRate: 300
    

scenarios:
  - name: dictionary (/dictionary)
    flow:
      - get:
          url: '/dictionary?word={{ word }}'