baseline/perf/root.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain1
      duration: 60
      arrivalRate: 50
    - name: Ramp1
      duration: 60
      arrivalRate: 50
      rampTo: 100
    - name: Plain2
      duration: 60
      arrivalRate: 100
    - name: Ramp2
      duration: 60
      arrivalRate: 100
      rampTo: 300
    - name: Plain3
      duration: 60
      arrivalRate: 200
    - name: PlainEnd
      duration: 1
      arrivalRate: 1
    

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/ping'